

#+OPTIONS:    H:3 num:nil toc:2 \n:nil ::t |:t ^:{} -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+STARTUP:    align fold nodlcheck hidestars oddeven lognotestate hideblocks
#+SEQ_TODO:   TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) noexport(n)
#+TITLE:      Babel: Introduction
#+AUTHOR:     Eric Schulte, Dan Davison, Tom Dye
#+EMAIL:      schulte.eric at gmail dot com, davison at stats dot ox dot ac dot uk, tsd at tsdye dot com
#+LANGUAGE:   en
#+HTML_HEAD:      <style type="text/css">#outline-container-introduction{ clear:both; }</style>
#+HTML_HEAD:      <style type="text/css">#table-of-contents{ max-width:100%; }</style>
#+LINK_UP:  index.php
#+LINK_HOME: http://orgmode.org/worg

*** R 
     What are the most common words in this file?
In the Org-mode file:
: #+begin_src R :colnames yes
:   words <- tolower(scan("intro.org", what="", na.strings=c("|",":")))
:   t(sort(table(words[nchar(words) > 3]), decreasing=TRUE)[1:10])
: #+end_src

HTML export of code:

#+begin_src R :colnames yes
  words <- tolower(scan("intro.org", what="", na.strings=c("|",":")))
  t(sort(table(words[nchar(words) > 3]), decreasing=TRUE)[1:10])
#+end_src

#+RESULTS:
| code | org-mode | #+end_src | #+begin_src | block | with | babel | that | #+name: | this |
|------+----------+-----------+-------------+-------+------+-------+------+---------+------|
|   85 |       60 |        47 |          44 |    40 |   38 |    35 |   34 |      33 |   33 |

*** Example 2: Babel Test Suite
While developing Babel, we used a suite of tests implemented
as a large Org-mode table.  To run the entire test suite we simply
evaluate the table with C-u C-c C-c: all of the tests are run,
the results are compared with expectations, and the table is updated
with results and pass/fail statistics.

Here's a sample of our test suite.

In the Org-mode file:

: #+TBLNAME: org-babel-tests
: | functionality    | block        | arg |    expected |     results | pass |
: |------------------+--------------+-----+-------------+-------------+------|
: | basic evaluation |              |     |             |             | pass |
: |------------------+--------------+-----+-------------+-------------+------|
: | emacs lisp       | basic-elisp  |   2 |           4 |           4 | pass |
: | shell            | basic-shell  |     |           6 |           6 | pass |
: | ruby             | basic-ruby   |     |   org-babel |   org-babel | pass |
: | python           | basic-python |     | hello world | hello world | pass |
: | R                | basic-R      |     |          13 |          13 | pass |
: #+TBLFM: $5='(if (= (length $3) 1) (sbe $2 (n $3)) (sbe $2)) :: $6='(if (string= $4 $5) "pass" (format "expected %S but was %S" $4 $5))

HTML export of code:

#+TBLNAME: org-babel-tests
| functionality    | block        | arg |    expected |     results | pass |
|------------------+--------------+-----+-------------+-------------+------|
| basic evaluation |              |     |             |             | pass |
|------------------+--------------+-----+-------------+-------------+------|
| emacs lisp       | basic-elisp  |   2 |           4 |           4 | pass |
| shell            | basic-shell  |     |           6 |           6 | pass |
| ruby             | basic-ruby   |     |   org-babel |   org-babel | pass |
| python           | basic-python |     | hello world | hello world | pass |
| R                | basic-R      |     |          13 |          13 | pass |
#+TBLFM: $5='(if (= (length $3) 1) (sbe $2 (n $3)) (sbe $2)) :: $6='(if (string= $4 $5) "pass" (format "expected %S but was %S" $4 $5))

